#include "imgui.h"
#include "imgui_impl_sdl.h"
#include "imgui_impl_opengl3.h"
#include "imgui_memory_editor.h"
#include <stdio.h>
#include <SDL.h>

#if defined(IMGUI_IMPL_OPENGL_ES2)
#include <GLES2/gl2.h>
// About Desktop OpenGL function loaders:
//  Modern desktop OpenGL doesn't have a standard portable header file to load OpenGL function pointers.
//  Helper libraries are often used for this purpose! Here we are supporting a few common ones (gl3w, glew, glad).
//  You may use another loader/header of your choice (glext, glLoadGen, etc.), or choose to manually implement your own.
#elif defined(IMGUI_IMPL_OPENGL_LOADER_GL3W)
#include <GL/gl3w.h>  // Initialize with gl3wInit()
#elif defined(IMGUI_IMPL_OPENGL_LOADER_GLEW)
#include <GL/glew.h>  // Initialize with glewInit()
#elif defined(IMGUI_IMPL_OPENGL_LOADER_GLAD)
#include <glad/glad.h>  // Initialize with gladLoadGL()
#elif defined(IMGUI_IMPL_OPENGL_LOADER_GLAD2)
#include <glad/gl.h>  // Initialize with gladLoadGL(...) or gladLoaderLoadGL()
#elif defined(IMGUI_IMPL_OPENGL_LOADER_GLBINDING2)
#define GLFW_INCLUDE_NONE  // GLFW including OpenGL headers causes ambiguity or multiple definition errors.
#include <glbinding/Binding.h>  // Initialize with glbinding::Binding::initialize()
#include <glbinding/gl/gl.h>
using namespace gl;
#elif defined(IMGUI_IMPL_OPENGL_LOADER_GLBINDING3)
#define GLFW_INCLUDE_NONE  // GLFW including OpenGL headers causes ambiguity or multiple definition errors.
#include <glbinding/glbinding.h>  // Initialize with glbinding::initialize()
#include <glbinding/gl/gl.h>
using namespace gl;
#else
#include IMGUI_IMPL_OPENGL_LOADER_CUSTOM
#endif

#include <assert.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "algorithms.h"
#include "cpu.h"

#define UNUSED(x) (void)(x)

bool single_step = false;
uint64_t start_logging_at = 0;
//uint64_t end_logging_at = 200000;
int ppu_cycles = 0;
int timer_cycles = 0;
bool halted = false;
uint32_t last_bios_access = 0xe4;
bool skip_bios = false;
bool has_eeprom = false;
bool has_flash = false;
//bool has_rtc = false;
bool has_sram = false;

//#define LOG_BAD_MEMORY_ACCESS

#define SCREEN_WIDTH  240
#define SCREEN_HEIGHT 160

uint32_t screen_texture;
uint32_t screen_pixels[SCREEN_HEIGHT][SCREEN_WIDTH];
int screen_scale = 3;

typedef struct {
    int left;
    int top;
    int right;
    int bottom;
} window_t;

window_t win0, win1;

bool is_point_in_window(int x, int y, window_t win) {
    bool x_ok = false;
    bool y_ok = false;

    if (win.left < win.right) {
        x_ok = (x >= win.left && x < win.right);
    } else if (win.left > win.right) {
        x_ok = (x >= win.left || x < win.right);
    }
    if (win.top < win.bottom) {
        y_ok = (y >= win.top && y < win.bottom);
    } else if (win.top > win.bottom) {
        y_ok = (y >= win.top || y < win.bottom);
    }

    return (x_ok && y_ok);
}

double fixed24p8_to_double(uint32_t x) {
    double result = (x >> 8) + ((x & 0xff) / 256.0);
    if (result > 524288.0) result -= 1048576.0;
    return result;
}

uint8_t system_rom[0x4000];
uint8_t cpu_ewram[0x40000];
uint8_t cpu_iwram[0x8000];
uint8_t palette_ram[0x400];
uint8_t video_ram[0x18000];
uint8_t object_ram[0x400];
uint8_t game_rom[0x2000000];
uint32_t game_rom_size;
uint32_t game_rom_mask;
uint8_t backup_eeprom[0x2000];
uint8_t backup_flash[0x20000];
uint8_t backup_sram[0x10000];

#define DCNT_GB         (1 << 3)
#define DCNT_PAGE       (1 << 4)
#define DCNT_OAM_HBL    (1 << 5)
#define DCNT_OBJ_1D     (1 << 6)
#define DCNT_BLANK      (1 << 7)
#define DCNT_BG0        (1 << 8)
#define DCNT_BG1        (1 << 9)
#define DCNT_BG2        (1 << 10)
#define DCNT_BG3        (1 << 11)
#define DCNT_OBJ        (1 << 12)
#define DCNT_WIN0       (1 << 13)
#define DCNT_WIN1       (1 << 14)
#define DCNT_WINOBJ     (1 << 15)

#define DSTAT_IN_VBL    (1 << 0)
#define DSTAT_IN_HBL    (1 << 1)
#define DSTAT_IN_VCT    (1 << 2)
#define DSTAT_VBL_IRQ   (1 << 3)
#define DSTAT_HBL_IRQ   (1 << 4)
#define DSTAT_VCT_IRQ   (1 << 5)

#define DMA_INC         0
#define DMA_DEC         1
#define DMA_FIXED       2
#define DMA_RELOAD      3
#define DMA_REPEAT      (1 << 25)
#define DMA_32          (1 << 26)
#define DMA_DRQ         (1 << 27)
#define DMA_NOW         0
#define DMA_AT_VBLANK   1
#define DMA_AT_HBLANK   2
#define DMA_AT_REFRESH  3
#define DMA_IRQ         (1 << 30)
#define DMA_ENABLE      (1 << 31)

#define INT_VBLANK      (1 << 0)
#define INT_HBLANK      (1 << 1)
#define INT_VCOUNT      (1 << 2)
#define INT_TIMER0      (1 << 3)
#define INT_TIMER1      (1 << 4)
#define INT_TIMER2      (1 << 5)
#define INT_TIMER3      (1 << 6)
#define INT_COM         (1 << 7)
#define INT_DMA0        (1 << 8)
#define INT_DMA1        (1 << 9)
#define INT_DMA2        (1 << 10)
#define INT_DMA3        (1 << 11)
#define INT_BUTTON      (1 << 12)
#define INT_CART        (1 << 13)

#define REG_DISPCNT     0
#define REG_DISPSTAT    4
#define REG_VCOUNT      6
#define REG_BG0CNT      8
#define REG_BG1CNT      0xa
#define REG_BG2CNT      0xc
#define REG_BG3CNT      0xe
#define REG_BG0HOFS     0x10
#define REG_BG0VOFS     0x12
#define REG_BG1HOFS     0x14
#define REG_BG1VOFS     0x16
#define REG_BG2HOFS     0x18
#define REG_BG2VOFS     0x1a
#define REG_BG3HOFS     0x1c
#define REG_BG3VOFS     0x1e
#define REG_BG2PA       0x20
#define REG_BG2PB       0x22
#define REG_BG2PC       0x24
#define REG_BG2PD       0x26
#define REG_BG2X_L      0x28
#define REG_BG2X_H      0x2a
#define REG_BG2Y_L      0x2c
#define REG_BG2Y_H      0x2e
#define REG_BG3PA       0x30
#define REG_BG3PB       0x32
#define REG_BG3PC       0x34
#define REG_BG3PD       0x36
#define REG_BG3X_L      0x38
#define REG_BG3X_H      0x3a
#define REG_BG3Y_L      0x3c
#define REG_BG3Y_H      0x3e
#define REG_WIN0H       0x40
#define REG_WIN1H       0x42
#define REG_WIN0V       0x44
#define REG_WIN1V       0x46
#define REG_WININ       0x48
#define REG_WINOUT      0x4a
#define REG_MOSAIC      0x4c
#define REG_BLDCNT      0x50
#define REG_BLDALPHA    0x52
#define REG_BLDY        0x54
#define REG_SOUND1CNT_L 0x60
#define REG_SOUND1CNT_H 0x62
#define REG_SOUND1CNT_X 0x64
#define REG_SOUND2CNT_L 0x68
#define REG_SOUND2CNT_H 0x6c
#define REG_SOUND3CNT_L 0x70
#define REG_SOUND3CNT_H 0x72
#define REG_SOUND3CNT_X 0x74
#define REG_SOUND4CNT_L 0x78
#define REG_SOUND4CNT_H 0x7c
#define REG_SOUNDCNT_L  0x80
#define REG_SOUNDCNT_H  0x82
#define REG_SOUNDCNT_X  0x84
#define REG_SOUNDBIAS   0x88
#define REG_WAVE_RAM0_L 0x90
#define REG_WAVE_RAM0_H 0x92
#define REG_WAVE_RAM1_L 0x94
#define REG_WAVE_RAM1_H 0x96
#define REG_WAVE_RAM2_L 0x98
#define REG_WAVE_RAM2_H 0x9a
#define REG_WAVE_RAM3_L 0x9c
#define REG_WAVE_RAM3_H 0x9e
#define REG_FIFO_A_L    0xa0
#define REG_FIFO_A_H    0xa2
#define REG_FIFO_B_L    0xa4
#define REG_FIFO_B_H    0xa6
#define REG_DMA0SAD_L   0xb0
#define REG_DMA0SAD_H   0xb2
#define REG_DMA0DAD_L   0xb4
#define REG_DMA0DAD_H   0xb6
#define REG_DMA0CNT_L   0xb8
#define REG_DMA0CNT_H   0xba
#define REG_DMA1SAD_L   0xbc
#define REG_DMA1SAD_H   0xbe
#define REG_DMA1DAD_L   0xc0
#define REG_DMA1DAD_H   0xc2
#define REG_DMA1CNT_L   0xc4
#define REG_DMA1CNT_H   0xc6
#define REG_DMA2SAD_L   0xc8
#define REG_DMA2SAD_H   0xca
#define REG_DMA2DAD_L   0xcc
#define REG_DMA2DAD_H   0xce
#define REG_DMA2CNT_L   0xd0
#define REG_DMA2CNT_H   0xd2
#define REG_DMA3SAD_L   0xd4
#define REG_DMA3SAD_H   0xd6
#define REG_DMA3DAD_L   0xd8
#define REG_DMA3DAD_H   0xda
#define REG_DMA3CNT_L   0xdc
#define REG_DMA3CNT_H   0xde
#define REG_TM0CNT_L    0x100
#define REG_TM0CNT_H    0x102
#define REG_TM1CNT_L    0x104
#define REG_TM1CNT_H    0x106
#define REG_TM2CNT_L    0x108
#define REG_TM2CNT_H    0x10a
#define REG_TM3CNT_L    0x10c
#define REG_TM3CNT_H    0x10e

#define REG_SIODATA32   0x120
#define REG_SIOCNT      0x128
#define REG_KEYINPUT    0x130
#define REG_KEYCNT      0x132
#define REG_RCNT        0x134
#define REG_IE          0x200
#define REG_IF          0x202
#define REG_WAITCNT     0x204
#define REG_IME         0x208
#define REG_POSTFLG     0x300
#define REG_HALTCNT     0x301

#define FIFO_SIZE 8192

struct {
    uint16_t io_dispcnt;
    uint16_t io_dispstat;
    uint16_t io_vcount;
    uint16_t io_bg0cnt;
    uint16_t io_bg1cnt;
    uint16_t io_bg2cnt;
    uint16_t io_bg3cnt;
    uint16_t io_bg0hofs;
    uint16_t io_bg0vofs;
    uint16_t io_bg1hofs;
    uint16_t io_bg1vofs;
    uint16_t io_bg2hofs;
    uint16_t io_bg2vofs;
    uint16_t io_bg3hofs;
    uint16_t io_bg3vofs;
    uint16_t io_bg2pa;
    uint16_t io_bg2pb;
    uint16_t io_bg2pc;
    uint16_t io_bg2pd;
    uint32_t io_bg2x;  // 32
    uint32_t io_bg2y;  // 32
    uint16_t io_bg3pa;
    uint16_t io_bg3pb;
    uint16_t io_bg3pc;
    uint16_t io_bg3pd;
    uint32_t io_bg3x;  // 32
    uint32_t io_bg3y;  // 32
    uint16_t io_win0h;
    uint16_t io_win1h;
    uint16_t io_win0v;
    uint16_t io_win1v;
    uint16_t io_winin;
    uint16_t io_winout;
    uint16_t io_mosaic;
    uint16_t io_bldcnt;
    uint16_t io_bldalpha;
    uint16_t io_bldy;
    uint16_t io_sound1cnt_l, io_sound1cnt_h, io_sound1cnt_x;
    uint16_t io_sound2cnt_l, io_sound2cnt_h;
    uint16_t io_sound3cnt_l, io_sound3cnt_h, io_sound3cnt_x;
    uint16_t io_sound4cnt_l, io_sound4cnt_h;
    uint16_t io_soundcnt_l, io_soundcnt_h, io_soundcnt_x;
    uint16_t io_soundbias;
    uint32_t io_wave_ram0;  // 32
    uint32_t io_wave_ram1;  // 32
    uint32_t io_wave_ram2;  // 32
    uint32_t io_wave_ram3;  // 32
    uint8_t fifo_a[FIFO_SIZE];
    uint8_t fifo_b[FIFO_SIZE];
    uint32_t io_dma0sad;  // 32
    uint32_t io_dma0dad;  // 32
    uint16_t io_dma0cnt_l, io_dma0cnt_h;
    uint32_t io_dma1sad;  // 32
    uint32_t io_dma1dad;  // 32
    uint16_t io_dma1cnt_l, io_dma1cnt_h;
    uint32_t io_dma2sad;  // 32
    uint32_t io_dma2dad;  // 32
    uint16_t io_dma2cnt_l, io_dma2cnt_h;
    uint32_t io_dma3sad;  // 32
    uint32_t io_dma3dad;  // 32
    uint16_t io_dma3cnt_l, io_dma3cnt_h;

    int fifo_a_r, fifo_b_r;
    int fifo_a_w, fifo_b_w;
    bool fifo_a_refill, fifo_b_refill;
    uint16_t timer_0_counter, timer_0_reload, timer_0_control;
    uint16_t timer_1_counter, timer_1_reload, timer_1_control;
    uint16_t timer_2_counter, timer_2_reload, timer_2_control;
    uint16_t timer_3_counter, timer_3_reload, timer_3_control;

    uint16_t io_keyinput;
    uint16_t io_keycnt;
    uint16_t io_rcnt;
    uint16_t io_ie;
    uint16_t io_if;
    uint16_t io_waitcnt;
    uint16_t io_ime;
    uint8_t io_haltcnt;
} ioreg;

//int dma_active = -1;
//bool dma_special = false;

void gba_audio_callback(void *userdata, uint8_t *stream, int len) {
    UNUSED(userdata);

    static int hold_amount = 4;
    static int a_hold = 0;
    static int b_hold = 0;

    for (int i = 0; i < len; i += 2) {
