#include "imgui.h"
#include "imgui_impl_sdl.h"
#include "imgui_impl_opengl3.h"
#include <stdio.h>
#include <SDL.h>

#if defined(IMGUI_IMPL_OPENGL_ES2)
#include <GLES2/gl2.h>
// About Desktop OpenGL function loaders:
//  Modern desktop OpenGL doesn't have a standard portable header file to load OpenGL function pointers.
//  Helper libraries are often used for this purpose! Here we are supporting a few common ones (gl3w, glew, glad).
//  You may use another loader/header of your choice (glext, glLoadGen, etc.), or choose to manually implement your own.
#elif defined(IMGUI_IMPL_OPENGL_LOADER_GL3W)
#include <GL/gl3w.h>  // Initialize with gl3wInit()
#elif defined(IMGUI_IMPL_OPENGL_LOADER_GLEW)
#include <GL/glew.h>  // Initialize with glewInit()
#elif defined(IMGUI_IMPL_OPENGL_LOADER_GLAD)
#include <glad/glad.h>  // Initialize with gladLoadGL()
#elif defined(IMGUI_IMPL_OPENGL_LOADER_GLAD2)
#include <glad/gl.h>  // Initialize with gladLoadGL(...) or gladLoaderLoadGL()
#elif defined(IMGUI_IMPL_OPENGL_LOADER_GLBINDING2)
#define GLFW_INCLUDE_NONE  // GLFW including OpenGL headers causes ambiguity or multiple definition errors.
#include <glbinding/Binding.h>  // Initialize with glbinding::Binding::initialize()
#include <glbinding/gl/gl.h>
using namespace gl;
#elif defined(IMGUI_IMPL_OPENGL_LOADER_GLBINDING3)
#define GLFW_INCLUDE_NONE  // GLFW including OpenGL headers causes ambiguity or multiple definition errors.

#define REG_BG0HOFS     0x10
#define REG_BG0VOFS     0x12
#define REG_BG1HOFS     0x14
#define REG_BG1VOFS     0x16
#define REG_BG2HOFS     0x18
#define REG_BG2VOFS     0x1a
#define REG_BG3HOFS     0x1c
#define REG_BG3VOFS     0x1e
#define REG_BG2PA       0x20
#define REG_BG2PB       0x22
#define REG_BG2PC       0x24
#define REG_BG2PD       0x26
#define REG_BG2X_L      0x28
#define REG_BG2X_H      0x2a
#define REG_BG2Y_L      0x2c
#define REG_BG2Y_H      0x2e
#define REG_BG3PA       0x30
#define REG_BG3PB       0x32
#define REG_BG3PC       0x34
#define REG_BG3PD       0x36
#define REG_BG3X_L      0x38
#define REG_BG3X_H      0x3a
#define REG_BG3Y_L      0x3c
#define REG_BG3Y_H      0x3e
#define REG_WIN0H       0x40
#define REG_WIN1H       0x42
#define REG_WIN0V       0x44
#define REG_WIN1V       0x46
#define REG_WININ       0x48
#define REG_WINOUT      0x4a
#define REG_MOSAIC      0x4c
#define REG_BLDCNT      0x50
#define REG_BLDALPHA    0x52
#define REG_BLDY        0x54
#define REG_SOUND1CNT_L 0x60
#define REG_SOUND1CNT_H 0x62
#define REG_SOUND1CNT_X 0x64
#define REG_SOUND2CNT_L 0x68
#define REG_SOUND2CNT_H 0x6c
#define REG_SOUND3CNT_L 0x70
#define REG_SOUND3CNT_H 0x72
#define REG_SOUND3CNT_X 0x74
#define REG_SOUND4CNT_L 0x78
#define REG_SOUND4CNT_H 0x7c
#define REG_SOUNDCNT_L  0x80
#define REG_SOUNDCNT_H  0x82
#define REG_SOUNDCNT_X  0x84
#define REG_SOUNDBIAS   0x88
#define REG_WAVE_RAM0_L 0x90
#define REG_WAVE_RAM0_H 0x92
#define REG_WAVE_RAM1_L 0x94
#define REG_WAVE_RAM1_H 0x96
#define REG_WAVE_RAM2_L 0x98
#define REG_WAVE_RAM2_H 0x9a
#define REG_WAVE_RAM3_L 0x9c
#define REG_WAVE_RAM3_H 0x9e
#define REG_FIFO_A_L    0xa0
#define REG_FIFO_A_H    0xa2
#define REG_FIFO_B_L    0xa4
#define REG_FIFO_B_H    0xa6
#define REG_DMA0SAD_L   0xb0
#define REG_DMA0SAD_H   0xb2
#define REG_DMA0DAD_L   0xb4
#define REG_DMA0DAD_H   0xb6
#define REG_DMA0CNT_L   0xb8
#define REG_DMA0CNT_H   0xba
#define REG_DMA1SAD_L   0xbc
#define REG_DMA1SAD_H   0xbe
#define REG_DMA1DAD_L   0xc0
#define REG_DMA1DAD_H   0xc2
#define REG_DMA1CNT_L   0xc4
#define REG_DMA1CNT_H   0xc6
#define REG_DMA2SAD_L   0xc8
#define REG_DMA2SAD_H   0xca
#define REG_DMA2DAD_L   0xcc
#define REG_DMA2DAD_H   0xce
#define REG_DMA2CNT_L   0xd0
#define REG_DMA2CNT_H   0xd2
#define REG_DMA3SAD_L   0xd4
#define REG_DMA3SAD_H   0xd6
#define REG_DMA3DAD_L   0xd8
#define REG_DMA3DAD_H   0xda
#define REG_DMA3CNT_L   0xdc
#define REG_DMA3CNT_H   0xde
#define REG_TM0CNT_L    0x100
#define REG_TM0CNT_H    0x102
#define REG_TM1CNT_L    0x104
#define REG_TM1CNT_H    0x106
#define REG_TM2CNT_L    0x108
#define REG_TM2CNT_H    0x10a
#define REG_TM3CNT_L    0x10c
#define REG_TM3CNT_H    0x10e

#define REG_SIODATA32   0x120
#define REG_SIOCNT      0x128
#define REG_KEYINPUT    0x130
#define REG_KEYCNT      0x132
#define REG_RCNT        0x134
#define REG_IE          0x200
#define REG_IF          0x202
#define REG_WAITCNT     0x204
#define REG_IME         0x208
#define REG_POSTFLG     0x300
#define REG_HALTCNT     0x301

struct {
    uint16_t io_dispcnt;
    uint16_t io_dispstat;
    uint16_t io_vcount;
    uint16_t io_bg0cnt;
    uint16_t io_bg1cnt;
    uint16_t io_bg2cnt;
    uint16_t io_bg3cnt;
    uint16_t io_bg0hofs;
    uint16_t io_bg0vofs;
    uint16_t io_bg1hofs;
    uint16_t io_bg1vofs;
    uint16_t io_bg2hofs;
    uint16_t io_bg2vofs;
    uint16_t io_bg3hofs;
    uint16_t io_bg3vofs;
    uint16_t io_bg2pa;
    uint16_t io_bg2pb;
    uint16_t io_bg2pc;
    uint16_t io_bg2pd;
    uint32_t io_bg2x;  // 32
    uint32_t io_bg2y;  // 32
    uint16_t io_bg3pa;
    uint16_t io_bg3pb;
    uint16_t io_bg3pc;
    uint16_t io_bg3pd;
    uint32_t io_bg3x;  // 32
    uint32_t io_bg3y;  // 32
    uint16_t io_win0h;
    uint16_t io_win1h;
    uint16_t io_win0v;
    uint16_t io_win1v;
    uint16_t io_winin;
    uint16_t io_winout;
    uint16_t io_mosaic;
    uint16_t io_bldcnt;
    uint16_t io_bldalpha;
    uint16_t io_bldy;
    uint16_t io_sound1cnt_l, io_sound1cnt_h, io_sound1cnt_x;
    uint16_t io_sound2cnt_l, io_sound2cnt_h;
    uint16_t io_sound3cnt_l, io_sound3cnt_h, io_sound3cnt_x;
    uint16_t io_sound4cnt_l, io_sound4cnt_h;
    uint16_t io_soundcnt_l, io_soundcnt_h, io_soundcnt_x;
    uint16_t io_soundbias;
    uint32_t io_wave_ram0;  // 32
    uint32_t io_wave_ram1;  // 32
    uint32_t io_wave_ram2;  // 32
    uint32_t io_wave_ram3;  // 32
    uint32_t io_fifo_a;  // 32
    uint32_t io_fifo_b;  // 32
    uint32_t io_dma0sad;  // 32
    uint32_t io_dma0dad;  // 32
    uint16_t io_dma0cnt_l, io_dma0cnt_h;
    uint32_t io_dma1sad;  // 32
    uint32_t io_dma1dad;  // 32
    uint16_t io_dma1cnt_l, io_dma1cnt_h;
    uint32_t io_dma2sad;  // 32
    uint32_t io_dma2dad;  // 32
    uint16_t io_dma2cnt_l, io_dma2cnt_h;
    uint32_t io_dma3sad;  // 32
    uint32_t io_dma3dad;  // 32
    uint16_t io_dma3cnt_l, io_dma3cnt_h;

    bool fifo_a_refill, fifo_b_refill;
    uint16_t timer_0_counter, timer_0_reload, timer_0_control;
    uint16_t timer_1_counter, timer_1_reload, timer_1_control;
    uint16_t timer_2_counter, timer_2_reload, timer_2_control;
    uint16_t timer_3_counter, timer_3_reload, timer_3_control;

    uint16_t io_keyinput;
    uint16_t io_keycnt;
    uint16_t io_rcnt;
    uint16_t io_ie;
    uint16_t io_if;
    uint16_t io_waitcnt;
    uint16_t io_ime;
    uint8_t io_haltcnt;
} ioreg;

uint8_t io_read_byte(uint32_t address) {
    switch (address) {
        case REG_DISPCNT + 0: return (uint8_t)(ioreg.io_dispcnt >> 0);
        case REG_DISPCNT + 1: return (uint8_t)(ioreg.io_dispcnt >> 8);
        case 0x2: return 0xad;
        case 0x3: return 0xde;
        case REG_DISPSTAT + 0: return (uint8_t)(ioreg.io_dispstat >> 0);
        case REG_DISPSTAT + 1: return (uint8_t)(ioreg.io_dispstat >> 8);
